run/greyBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (0.0 0.0 0.0)
    (1.0 0.0 0.0)
    (1.0 0.5 0.0)
    (0.0 0.5 0.0)
    (0.0 0.0 0.1)
    (1.0 0.0 0.1)
    (1.0 0.5 0.1)
    (0.0 0.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 120 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 6 7 3)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //